In [3]:
import pandas as pd
import os
import random
import numpy as np

# Generate random data with missing values
data = {
    'Id': [i+1 for i in range(500)],
    'Gender': [random.choice(['M', 'F', np.nan]) for _ in range(500)],
    'Age': [random.randint(18, 65) if random.random() > 0.1 else np.nan for _ in range(500)],
    'Income': [random.randint(20000, 150000) if random.random() > 0.2 else np.nan for _ in range(500)],
    'Height': [random.uniform(150, 190) if random.random() > 0.1 else np.nan for _ in range(500)],
    'Weight': [random.uniform(50, 100) if random.random() > 0.1 else np.nan for _ in range(500)]
}

# Create a DataFrame
df = pd.DataFrame(data)

# Save DataFrame to a CSV file
output_folder_path = '/Users/mrahman-admin/Desktop/Data_Analytics_Visualization/DAV_Code'
output_file = os.path.join(output_folder_path, 'sample_dataset_pandas.csv')
df.to_csv(output_file, index=False)

print("Dataset saved to 'sample_dataset_pandas.csv'")

Dataset saved to 'sample_dataset_pandas.csv'

In [4]:
# Read CSV data
pd.read_csv(output_file)

      Id Gender   Age    Income      Height     Weight
0      1      M  64.0   24141.0         NaN  91.026092
1      2      F  18.0   82523.0  189.533369  72.400692
2      3    NaN  40.0   37928.0  153.884926  90.153410
3      4      F  47.0   83622.0  189.395822  63.506353
4      5      M  43.0  120475.0  155.234732  85.101889
..   ...    ...   ...       ...         ...        ...
495  496      M  52.0  143234.0  156.044812  66.805198
496  497      M   NaN   56023.0  159.155331  80.400186
497  498    NaN  44.0   45923.0  180.344630  63.905775
498  499      F  40.0   72164.0  151.121012        NaN
499  500    NaN  42.0       NaN  170.127901  51.950306

[500 rows x 6 columns]

In [5]:
# Read CSV data into a DataFrame
df = pd.read_csv(output_file)

In [6]:
df

      Id Gender   Age    Income      Height     Weight
0      1      M  64.0   24141.0         NaN  91.026092
1      2      F  18.0   82523.0  189.533369  72.400692
2      3    NaN  40.0   37928.0  153.884926  90.153410
3      4      F  47.0   83622.0  189.395822  63.506353
4      5      M  43.0  120475.0  155.234732  85.101889
..   ...    ...   ...       ...         ...        ...
495  496      M  52.0  143234.0  156.044812  66.805198
496  497      M   NaN   56023.0  159.155331  80.400186
497  498    NaN  44.0   45923.0  180.344630  63.905775
498  499      F  40.0   72164.0  151.121012        NaN
499  500    NaN  42.0       NaN  170.127901  51.950306

[500 rows x 6 columns]

In [7]:
df.head()

   Id Gender   Age    Income      Height     Weight
0   1      M  64.0   24141.0         NaN  91.026092
1   2      F  18.0   82523.0  189.533369  72.400692
2   3    NaN  40.0   37928.0  153.884926  90.153410
3   4      F  47.0   83622.0  189.395822  63.506353
4   5      M  43.0  120475.0  155.234732  85.101889

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.dtypes

Id          int64
Gender     object
Age       float64
Income    float64
Height    float64
Weight    float64
dtype: object

In [10]:
# Get the shape of the DataFrame (attribute)
shape = df.shape
print(shape)  # Output: (rows, columns)

(500, 6)

In [ ]:
# Display the first 5 rows using the head method
first_rows = df.head(3)
print(first_rows)

   Id Gender   Age   Income      Height     Weight
0   1    NaN  24.0      NaN  175.805779  61.755954
1   2      F  34.0      NaN  188.569329  84.089073
2   3      F  29.0  91758.0         NaN        NaN

In [11]:
summary = df.describe()
print(summary)

               Id         Age         Income      Height      Weight
count  500.000000  452.000000     396.000000  453.000000  458.000000
mean   250.500000   41.856195   86108.492424  169.529216   75.025116
std    144.481833   13.940613   36654.922564   10.878351   14.774209
min      1.000000   18.000000   20045.000000  150.015783   50.295231
25%    125.750000   29.000000   57367.000000  160.017565   61.837609
50%    250.500000   42.000000   88871.000000  169.635492   75.331686
75%    375.250000   53.250000  116668.000000  178.288046   88.464562
max    500.000000   65.000000  149846.000000  189.968273   99.954461

In [12]:
pd.unique(df['Gender'])

array(['M', 'F', nan], dtype=object)

In [13]:
age_list = pd.unique(df['Age'])
len(age_list)

49

In [14]:
df['Id'].nunique()

500

In [15]:
info = df.info()
print(info)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      500 non-null    int64
 1   Gender  335 non-null    object
 2   Age     452 non-null    float64
 3   Income  396 non-null    float64
 4   Height  453 non-null    float64
 5   Weight  458 non-null    float64
dtypes: float64(4), int64(1), object(1)
memory usage: 23.6+ KB
None

In [16]:
age_std = df['Age'].std()
print("Age Standard Deviation:", age_std)

Age Standard Deviation: 13.94061308723697

In [17]:
gender_counts = df['Gender'].value_counts()
print(gender_counts)

Gender
M    172
F    163
Name: count, dtype: int64

In [18]:
df['Income'].describe()

count       396.000000
mean      86108.492424
std       36654.922564
min       20045.000000
25%       57367.000000
50%       88871.000000
75%      116668.000000
max      149846.000000
Name: Income, dtype: float64

In [19]:
df['Income'].max()

149846.0

In [20]:
# Group data by sex
grouped_data = df.groupby('Gender')

# Provide the mean for each numeric column by sex
grouped_data.mean(numeric_only=True)

                Id        Age        Income      Height     Weight
Gender
F       251.601227  42.506667  87623.476562  169.792936  73.881011
M       250.156977  42.487179  84219.478261  169.595148  74.700558

In [21]:
# Multiply all weight values by 2
df['Weight']*2

0      182.052185
1      144.801384
2      180.306819
3      127.012705
4      170.203778
          ...
495    133.610396
496    160.800372
497    127.811550
498           NaN
499    103.900612
Name: Weight, Length: 500, dtype: float64

In [22]:
# Select the 'Gender' column
df['Gender']

0        M
1        F
2      NaN
3        F
4        M
      ...
495      M
496      M
497    NaN
498      F
499    NaN
Name: Gender, Length: 500, dtype: object

In [23]:
# Select the 'Age' and 'Income' columns
age_income_columns = df[['Age', 'Income']]
print("\nSelected Age and Income columns:\n", age_income_columns)

Selected Age and Income columns:
       Age    Income
0    64.0   24141.0
1    18.0   82523.0
2    40.0   37928.0
3    47.0   83622.0
4    43.0  120475.0
..    ...       ...
495  52.0  143234.0
496   NaN   56023.0
497  44.0   45923.0
498  40.0   72164.0
499  42.0       NaN

[500 rows x 2 columns]

In [24]:
df.Gender

0        M
1        F
2      NaN
3        F
4        M
      ...
495      M
496      M
497    NaN
498      F
499    NaN
Name: Gender, Length: 500, dtype: object

In [25]:
age_income_columns = df[['Age', 'Income']]

In [26]:
# Sample list
my_list = [10, 20, 30, 40, 50, 60, 70, 80]

# Getting specific elements
element_at_index_2 = my_list[2]
print("Element at index 2:", element_at_index_2)

# Getting a set of elements
subset = my_list[2:5]
print("Subset from index 2 to 4:", subset)

# Getting first few elements
first_three_elements = my_list[:3]
print("First three elements:", first_three_elements)

# Getting last few elements
last_two_elements = my_list[-2:]
print("Last two elements:", last_two_elements)

Element at index 2: 30
Subset from index 2 to 4: [30, 40, 50]
First three elements: [10, 20, 30]
Last two elements: [70, 80]

In [27]:
# Slice rows 1 to 3 and columns 'Gender' and 'Age'
sliced_rows_columns_loc = df.loc[1:3, ['Gender', 'Age']]
print("Sliced Rows and Columns using .loc:\n", sliced_rows_columns_loc)

Sliced Rows and Columns using .loc:
   Gender   Age
1      F  18.0
2    NaN  40.0
3      F  47.0

In [28]:
# Slice rows 1 to 3 and columns at index 1 to 3
sliced_rows_columns_iloc = df.iloc[1:4, 1:4]
print("Sliced Rows and Columns using .iloc:\n", sliced_rows_columns_iloc)

Sliced Rows and Columns using .iloc:
   Gender   Age   Income
1      F  18.0  82523.0
2    NaN  40.0  37928.0
3      F  47.0  83622.0

In [29]:
# Subset data for individuals with age > 25
subset_age_gt_25 = df[df['Age'] > 25]
print("Subset of individuals with age > 25:\n", subset_age_gt_25)

Subset of individuals with age > 25:
       Id Gender   Age    Income      Height     Weight
0      1      M  64.0   24141.0         NaN  91.026092
2      3    NaN  40.0   37928.0  153.884926  90.153410
3      4      F  47.0   83622.0  189.395822  63.506353
4      5      M  43.0  120475.0  155.234732  85.101889
5      6      M  62.0  120535.0  179.602918  76.109803
..   ...    ...   ...       ...         ...        ...
494  495    NaN  55.0   60864.0  182.079665  71.311427
495  496      M  52.0  143234.0  156.044812  66.805198
497  498    NaN  44.0   45923.0  180.344630  63.905775
498  499      F  40.0   72164.0  151.121012        NaN
499  500    NaN  42.0       NaN  170.127901  51.950306

[374 rows x 6 columns]

In [30]:
# Subset data for individuals with age > 25 and income > 60000
subset_age_income = df[(df['Age'] > 25) & (df['Income'] > 60000)]
print("Subset of individuals with age > 25 and income > 60000:\n", subset_age_income)

Subset of individuals with age > 25 and income > 60000:
       Id Gender   Age    Income      Height     Weight
3      4      F  47.0   83622.0  189.395822  63.506353
4      5      M  43.0  120475.0  155.234732  85.101889
5      6      M  62.0  120535.0  179.602918  76.109803
6      7      M  53.0  145042.0  176.081178        NaN
7      8    NaN  61.0   97758.0  154.752066  81.734248
..   ...    ...   ...       ...         ...        ...
487  488      F  44.0  118330.0  179.536224  88.574138
490  491      F  60.0  117648.0  181.056243        NaN
494  495    NaN  55.0   60864.0  182.079665  71.311427
495  496      M  52.0  143234.0  156.044812  66.805198
498  499      F  40.0   72164.0  151.121012        NaN

[209 rows x 6 columns]

In [31]:
# Subset data for individuals with age <= 25
subset_age_le_25 = df[~(df['Age'] > 25)]
print("Subset of individuals with age <= 25:\n", subset_age_le_25)

Subset of individuals with age <= 25:
       Id Gender   Age    Income      Height     Weight
1      2      F  18.0   82523.0  189.533369  72.400692
11    12      M  21.0  134072.0  188.650997  52.732921
12    13    NaN  19.0       NaN  173.446142  61.146883
15    16    NaN  23.0   52297.0  171.859691  85.833607
16    17    NaN  23.0  126215.0  185.392064  81.741455
..   ...    ...   ...       ...         ...        ...
464  465    NaN   NaN       NaN  175.017878        NaN
474  475      F   NaN       NaN  187.281876  92.718267
479  480    NaN  22.0  140959.0  189.221855  94.844926
482  483    NaN  21.0   25786.0  155.483269  55.226594
496  497      M   NaN   56023.0  159.155331  80.400186

[126 rows x 6 columns]

In [32]:
new = df[~df['Gender'].isin(['M', 'F'])]
print(len(new))

print(sum(df['Gender'].isnull()))

165
165

In [33]:
# Subsetting data using isin() function
subset_gender = df[df['Gender'].isin(['M', 'F'])]
print("Subset of data with 'Gender' values 'M' or 'F':\n", subset_gender)

Subset of data with 'Gender' values 'M' or 'F':
       Id Gender   Age    Income      Height     Weight
0      1      M  64.0   24141.0         NaN  91.026092
1      2      F  18.0   82523.0  189.533369  72.400692
3      4      F  47.0   83622.0  189.395822  63.506353
4      5      M  43.0  120475.0  155.234732  85.101889
5      6      M  62.0  120535.0  179.602918  76.109803
..   ...    ...   ...       ...         ...        ...
492  493      M  58.0   21617.0  178.247016  96.618002
493  494      F  34.0   28917.0  150.552383  95.738284
495  496      M  52.0  143234.0  156.044812  66.805198
496  497      M   NaN   56023.0  159.155331  80.400186
498  499      F  40.0   72164.0  151.121012        NaN

[335 rows x 6 columns]

In [34]:
# Subsetting data using isnull() function
subset_missing_age = df[df['Age'].isnull()]
print("Subset of data with missing 'Age' values:\n", subset_missing_age)

Subset of data with missing 'Age' values:
       Id Gender  Age    Income      Height     Weight
34    35      M  NaN       NaN         NaN  77.748112
48    49      M  NaN   80545.0  160.882447  84.132224
49    50      M  NaN   84812.0  181.811067  50.797431
62    63      F  NaN       NaN  160.336857  68.404654
76    77      M  NaN   96922.0  150.758791  51.762343
81    82    NaN  NaN   85039.0  176.034126  82.357999
89    90    NaN  NaN  104684.0  151.599414  75.361666
91    92      F  NaN  144675.0  180.480869  56.129768
97    98      M  NaN  120095.0         NaN  89.292180
100  101    NaN  NaN   41682.0  154.944984  74.792711
121  122      M  NaN   35769.0  184.735616  68.987392
133  134    NaN  NaN       NaN  155.219858  79.753255
138  139    NaN  NaN       NaN  156.132598  96.430512
162  163    NaN  NaN   49601.0  169.890227  79.864129
193  194      M  NaN   76822.0  166.203285  77.342092
202  203      M  NaN  119766.0  162.412929  57.717951
203  204      M  NaN   80392.0  170.627908  61.763551
210  211      M  NaN  113168.0  183.899399  71.579327
219  220      F  NaN   77596.0  153.521195  62.904493
220  221    NaN  NaN  129430.0  167.199851  93.101603
223  224    NaN  NaN   30801.0  175.264463  88.145407
238  239    NaN  NaN  102611.0  174.147723  55.616176
255  256      F  NaN   83908.0  157.554053  54.634387
271  272      F  NaN   49065.0  181.625893  74.605277
272  273    NaN  NaN       NaN  152.807157  96.816610
281  282    NaN  NaN   60279.0         NaN  81.312038
290  291      M  NaN   89502.0  174.836518  82.937369
316  317      F  NaN   82987.0  167.628493  67.210730
319  320    NaN  NaN  102117.0  165.753825  64.207305
321  322      F  NaN  139531.0  180.007736  88.907256
334  335    NaN  NaN       NaN  178.593802  53.304731
342  343      M  NaN       NaN  165.102111  91.182177
346  347      F  NaN   53110.0  167.865724  76.519264
355  356    NaN  NaN  133845.0  159.094024        NaN
356  357      F  NaN  100898.0  163.542035        NaN
357  358      F  NaN   84165.0  182.256283  69.795188
364  365    NaN  NaN  100522.0  164.999876  72.985489
378  379      M  NaN   69210.0  168.582980  52.332044
382  383      M  NaN  117875.0  156.047811  66.995308
405  406    NaN  NaN   39802.0  174.895440  59.406596
409  410    NaN  NaN       NaN  185.328497  96.835473
411  412      M  NaN   55171.0         NaN  57.325667
426  427      F  NaN       NaN  154.711862  98.956591
436  437    NaN  NaN  124801.0  167.403461        NaN
439  440      F  NaN  101767.0  158.982296  62.287663
464  465    NaN  NaN       NaN  175.017878        NaN
474  475      F  NaN       NaN  187.281876  92.718267
496  497      M  NaN   56023.0  159.155331  80.400186